app/controllers/cabanas_controller.rb

SELECT * FROM `cabanas`
---
  def index
    @cabanas = Cabana.all

SELECT * FROM `cabanas` WHERE (`cabanas`.`id` = 1)
---
  def show
    @cabana = Cabana.find(params[:id])

SELECT * FROM `cabanas` WHERE (`cabanas`.`id` = 1)
---
  def edit
    @cabana = Cabana.find(params[:id])

INSERT INTO `cabanas` (`created_at`, `nombre`, `updated_at`, `descripcion`, `servicio_id`) VALUES('2009-09-16 15:10:59', 'Cipres', '2009-09-16 15:10:59', 'ssfsfsfsffsff', NULL)
---
  def create
    @cabana = Cabana.new(params[:cabana])

    respond_to do |format|
      if @cabana.save

SELECT * FROM `cabanas` WHERE (`cabanas`.`id` = 1)
UPDATE `cabanas` SET `updated_at` = '2009-09-26 21:16:23', `descripcion` = 'Unidad en 2 plantas con 2 dormitorios grandes con vista al Lago Nahuel Huapi , baño completo con bañadera, balcón, equipada totalmente para hasta 6 personas' WHERE `id` = 1
---
  def update
    @cabana = Cabana.find(params[:id])

    respond_to do |format|
      if @cabana.update_attributes(params[:cabana])