app/controllers/complejos_controller.rb

  def index
    @complejos = Complejo.all
---
SELECT * FROM `complejos`

  def show
    @complejo = Complejo.find(params[:id])
---
SELECT * FROM `complejos` WHERE (`complejos`.`id` = 1)

  def create
    @complejo = Complejo.new(params[:complejo])

    respond_to do |format|
      if @complejo.save
---
INSERT INTO `complejos` (`telefono`, `created_at`, `nombre`, `provincia`, `updated_at`, `ciudad`, `pais`, `direccion`, `email`) VALUES('', '2009-07-27 01:09:01', 'Cabaña Quillahue', 'Rio Negro', '2009-07-27 01:09:01', 'San Carlos de Bariloche', 'Argentina', 'Tronador 1411', 'quillahue@gmail.com')