app/controllers/contactos_controller.rb

SELECT * FROM `contactos`
---
  def index
    @contactos = Contactos.all