app/controllers/home_controller.rb

  def index
    @ubicacions = Ubicacion.all
    @promotions = Promotion.all
    @cabanas = Cabana.all
---
SELECT * FROM `ubicacions`
SELECT * FROM `promotions`
SELECT * FROM `cabanas`

  def servicios
    @servicios = Servicio.all
---
SELECT * FROM `servicios`

 def cipres
     @servicio = Servicio.all
---
SELECT * FROM `servicios`