app/controllers/promotions_controller.rb

SELECT * FROM `promotions`
---
  def index
    @promotions = Promotion.all

SELECT * FROM `promotions` WHERE (`promotions`.`id` = 0)
---
  def show
    @promotion = Promotion.find(params[:id])

SELECT * FROM `promotions` WHERE (`promotions`.`id` = 4)
---
  def edit
    @promotion = Promotion.find(params[:id])

INSERT INTO `promotions` (`created_at`, `photo_file_size`, `nombre`, `updated_at`, `photo_file_name`, `caduca`, `descripcion`, `photo_content_type`, `inicio`, `estado`) VALUES('2009-09-26 06:33:46', 6251, 'Navidad en Bariloche', '2009-09-26 06:33:46', 'navidad.jpeg', '2009-09-26 06:30:00', 'lindo bariloche en navidad', 'image/jpeg', '2009-09-26 06:30:00', 1)
---
  def create
    @promotion = Promotion.new(params[:promotion])

    respond_to do |format|
      if @promotion.save

SELECT * FROM `promotions` WHERE (`promotions`.`id` = 4)
UPDATE `promotions` SET `updated_at` = '2009-10-22 01:05:25', `photo_file_name` = 'banner1.jpg', `photo_file_size` = 9163 WHERE `id` = 1
---
  def update
    @promotion = Promotion.find(params[:id])

    respond_to do |format|
      if @promotion.update_attributes(params[:promotion])

SELECT * FROM `promotions` WHERE (`promotions`.`id` = 5)
DELETE FROM `promotions` WHERE `id` = 5
---
  def destroy
    @promotion = Promotion.find(params[:id])
    @promotion.destroy