app/controllers/servicios_controller.rb

  def index
    @servicios = Servicio.all
---
SELECT * FROM `servicios`

  def show
    @servicios = Servicios.find(params[:id])
---
SELECT * FROM `servicios` WHERE (`servicios`.`id` = 4)

  def create
    @servicios = Servicios.new(params[:servicios])

    respond_to do |format|
      if @servicios.save
---
INSERT INTO `servicios` (`created_at`, `nombre`, `cabana_id`, `updated_at`) VALUES('2009-09-30 03:02:49', '123', NULL, '2009-09-30 03:02:49')

  def destroy
    @servicios = Servicios.find(params[:id])
    @servicios.destroy
---
SELECT * FROM `servicios` WHERE (`servicios`.`id` = 4)
DELETE FROM `servicios` WHERE `id` = 4