app/controllers/ubicacions_controller.rb

  def index
    @ubicacions = Ubicacion.all
---
SELECT * FROM `ubicacions`

  def show
    @ubicacion = Ubicacion.find(params[:id])
---
SELECT * FROM `ubicacions` WHERE (`ubicacions`.`id` = 1)

  def edit
    @ubicacion = Ubicacion.find(params[:id])
---
SELECT * FROM `ubicacions` WHERE (`ubicacions`.`id` = 1)

  def create
    @ubicacion = Ubicacion.new(params[:ubicacion])

    respond_to do |format|
      if @ubicacion.save
---
INSERT INTO `ubicacions` (`created_at`, `tel1`, `updated_at`, `descripcion`, `direccion`, `cel`, `email`) VALUES('2009-09-16 02:10:38', '+54 02944 525574', '2009-09-16 02:10:38', 'Estamos en el km4 de la hermosa ruta al Llao Llao, a 100 mts del majestuoso Lago Nahuel Huapi, rodeados de añejos Cipreses de la cordillera y a los pies del Cerro Otto. Nuestra ubicación le permite llegar al Centro Cívico en 4 minutos, estamos en Melipal, el primer barrio de montaña, por lo que usted puede contar con todos los servicios como si estuviera en pleno centro pero disfrutando de la maravillosa naturaleza que nos rodea. Con acceso directo al Circuito Chico, el Cerro Catedral, y la ruta al Lago Gutierrez, Lago Mascardi, Lago Guillelmo, Pampa Linda, Volcán Tronador, Cascada los Alerces, y el Bolsón y a 1 cuadra de la ruta costanera que empalma con la Ruta 237 de salida a Neuquén, Buenos Aires, y el acceso a la ruta a Villa La Angostura, 7 lagos y San \r\nMartín de Los Andes, nuestra ubicación es inmejorable para disfrutar del entorno ahorrando tiempo de traslado hacia cada destino.”,\r\n', 'Tronador 4011', '+54 02944 15519302', 'quillahue@gmail.com')

  def update
    @ubicacion = Ubicacion.find(params[:id])

    respond_to do |format|
      if @ubicacion.update_attributes(params[:ubicacion])
---
SELECT * FROM `ubicacions` WHERE (`ubicacions`.`id` = 1)
UPDATE `ubicacions` SET `updated_at` = '2009-09-26 06:01:52', `descripcion` = 'Estamos en el km4 de la hermosa ruta al Llao Llao, a 100 mts del majestuoso Lago Nahuel Huapi, rodeados de añejos Cipreses de la cordillera y a los pies del Cerro Otto. Nuestra ubicación le permite llegar al Centro Cívico en 3 minutos, ubicados en el barrio Melipal, el primer barrio de montaña, por lo que usted puede contar con todos los servicios como si estuviera en pleno centro pero disfrutando de la maravillosa naturaleza que nos rodea. Con acceso directo al Circuito Chico, el Cerro Catedral, y la ruta al Lago Gutierrez, Lago Mascardi, Lago Guillelmo, Pampa Linda, Volcán Tronador, Cascada los Alerces, y el Bolsón y a 1 cuadra de la ruta costanera que empalma con la Ruta 237 de salida a Neuquén, Buenos Aires, y el acceso a la ruta a Villa La Angostura, 7 lagos y San Martín de Los Andes, nuestra ubicación es inmejorable para disfrutar del entorno ahorrando tiempo de traslado hacia cada destino.”\r\n' WHERE `id` = 1

  def destroy
    @ubicacion = Ubicacion.find(params[:id])
    @ubicacion.destroy
---
SELECT * FROM `ubicacions` WHERE (`ubicacions`.`id` = 2)
DELETE FROM `ubicacions` WHERE `id` = 2